Revit 2026 API

# SolidSolidCutUtilsIsElementFromAppropriateContext Method

---

Validates that the element is from an appropriate document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsElementFromAppropriateContext(
	Element element
)
```
```vb
Public Shared Function IsElementFromAppropriateContext (
	element As Element
) As Boolean
```
```cpp
public:
static bool IsElementFromAppropriateContext(
	Element^ element
)
```
```fsharp
static member IsElementFromAppropriateContext :
        element : Element -> bool
```

#### Parameters

element Element
     The solid to be cut or the cutting solid.

#### Return Value

Boolean True if the element is from an appropriate document for solid-solid cuts, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Currently an element from either a project document, conceptual model, pattern based curtain panel, or adaptive component family may participate in solid-solid cuts.

#### Reference

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace